example2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Testing ox-tufte Features</title>
<meta name="author" content="André Meneses" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
<link rel="stylesheet" href="ox-tufte.css" type="text/css" />
</head>
<body>
<header id="preamble" class="status">
<nav class="navbar"><ul><li><a href="index.html">Home</a></li><li><a href="about.html">About</a></li><li><a href="posts/index.html">Posts</a></li></ul></nav>
</header>
<article id="content" class="content">
<header>
<h1 class="title">Testing ox-tufte Features</h1>
</header>
<section id="outline-container-org99c01cb" class="outline-2">
<h2 id="org99c01cb">Introduction</h2>
<div class="outline-text-2" id="text-org99c01cb">
<p>
Some text with a margin note <label for='mn-auto.7953239' class='margin-toggle'>&#8853;</label><input type='checkbox' id='mn-auto.7953239' class='margin-toggle'><span class='marginnote'>This is an unnumbered margin note</span>. And we can continue writing.
</p>
</div>
</section>

<section id="outline-container-orgee35afe" class="outline-2">
<h2 id="orgee35afe">Block Margin Notes</h2>
<div class="outline-text-2" id="text-orgee35afe">
<p>
This paragraph will have a block margin note.
</p>

<label for='mn-auto.6293918' class='margin-toggle'>&#8853;</label><input type='checkbox' id='mn-auto.6293918' class='margin-toggle'><div class="marginnote" id="orgd98eb26">
<p>
This is a block margin note.
It can contain multiple paragraphs and lists:
</p>

<ul class="org-ul">
<li>First item</li>
<li>Second item</li>
</ul>

</div>

<p>
The text continues after the block margin note.
</p>
</div>
</section>

<section id="outline-container-org7f6f53b" class="outline-2">
<h2 id="org7f6f53b">Simple List Example</h2>
<div class="outline-text-2" id="text-org7f6f53b">
<ol class="org-ol">
<li>First item with a margin note <label for='mn-1.2856921' class='margin-toggle'>&#8853;</label><input type='checkbox' id='mn-1.2856921' class='margin-toggle'><span class='marginnote'>A note about the first item</span></li>
<li>Second item</li>
<li>Third item with another note <label for='mn-2.572549' class='margin-toggle'>&#8853;</label><input type='checkbox' id='mn-2.572549' class='margin-toggle'><span class='marginnote'>And a note about the third item</span></li>
</ol>
</div>
</section>
</article>
<footer id="postamble" class="status">
<p class="author">Author: André Meneses</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</footer>
</body>
</html>
